In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
#Now we'll learn about Index Hierarchy

#pandas allows you to have multiple index levels, which is very clear with this example:

ser = Series(np.random.randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [3]:
#Show Series with multiple index levels
ser

1  a   -1.905664
   b    0.634655
   c   -1.264052
2  a   -0.831781
   b    1.591661
   c    0.820407
dtype: float64

In [4]:
# We can check the multiple levels
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [5]:
#Now we can sleect specific subsets
ser[1]

a   -1.905664
b    0.634655
c   -1.264052
dtype: float64

In [6]:
# We can also select from an internal index level
ser[:,'a']

1   -1.905664
2   -0.831781
dtype: float64

In [7]:
# We can also create Data Frames from Series with multiple levels
dframe = ser.unstack()

#Show
dframe

          a         b         c
1 -1.905664  0.634655 -1.264052
2 -0.831781  1.591661  0.820407

In [8]:
#Can also reverse
dframe.unstack()

a  1   -1.905664
   2   -0.831781
b  1    0.634655
   2    1.591661
c  1   -1.264052
   2    0.820407
dtype: float64

In [9]:
# We can also apply multiple level indexing to DataFrames
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
                                                   
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [10]:
# We can also give these index levels names

#Name the index levels
dframe2.index.names = ['INDEX_1','INDEX_2']

#Name the column levels
dframe2.columns.names = ['Cities','Temp']

dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [11]:
# We can also interchange level orders (note the axis=1 for columns)
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [34]:
#We can also sort levels
dframe2.sort_index()

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [42]:
#We can also perform operations on particular levels - axis=0 (index) and axis=1 (Columns)
dframe2.groupby(level= 1,axis=1).sum()

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27